modules/account/vm/README.md
```mermaid
graph TD
accountdomain["account:domain"]
accountmodel["account:model"]
accountvm["account:vm"]
apiactual["api:actual"]
budgetmodel["budget:model"]
codegenannotation["codegen:annotation"]
coredi["core:di"]
coremodel["core:model"]
logging["logging"]
prefs["prefs"]
style accountdomain fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style accountmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style accountvm fill:#F5A6A6,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style apiactual fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style codegenannotation fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coredi fill:#FCB103,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coremodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style logging fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style prefs fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
accountdomain --> accountmodel
accountdomain -.-> apiactual
accountdomain -.-> logging
accountdomain -.-> prefs
accountvm --> accountdomain
accountvm --> accountmodel
accountvm -.-> apiactual
accountvm --> coredi
accountvm --> coremodel
accountvm -.-> logging
accountvm --> prefs
apiactual --> accountmodel
apiactual --> budgetmodel
apiactual -.-> codegenannotation
apiactual --> coremodel
prefs --> accountmodel
prefs --> coremodel
```
