modules/account/vm/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","label"=":account:vm","labelloc"="t","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":account:domain" ["fillcolor"="#9D8DF1","shape"="none"]
":account:model" ["fillcolor"="#9D8DF1","shape"="none"]
":account:vm" ["fillcolor"="#F5A6A6","color"="black","penwidth"="3","shape"="box"]
":api:actual" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:model" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:di" ["fillcolor"="#FCB103","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
":prefs" ["fillcolor"="#9D8DF1","shape"="none"]
{
edge ["dir"="none"]
graph ["rank"="same"]
":account:vm"
}
":account:domain" -> ":account:model"
":account:domain" -> ":api:actual" ["style"="dotted"]
":account:domain" -> ":logging" ["style"="dotted"]
":account:domain" -> ":prefs" ["style"="dotted"]
":account:vm" -> ":account:domain"
":account:vm" -> ":account:model"
":account:vm" -> ":api:actual" ["style"="dotted"]
":account:vm" -> ":core:di"
":account:vm" -> ":core:model"
":account:vm" -> ":logging" ["style"="dotted"]
":account:vm" -> ":prefs"
":api:actual" -> ":account:model"
":api:actual" -> ":budget:model"
":api:actual" -> ":codegen:annotation" ["style"="dotted"]
":api:actual" -> ":core:model"
":prefs" -> ":account:model"
":prefs" -> ":core:model"
}
